In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [5]:
data = Series(['one','two',np.nan,'three'])

In [6]:
data

0      one
1      two
2      NaN
3    three
dtype: object

In [7]:
data.isnull

<bound method Series.isnull of 0      one
1      two
2      NaN
3    three
dtype: object>

In [8]:
data.dropna

<bound method Series.dropna of 0      one
1      two
2      NaN
3    three
dtype: object>

In [9]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [10]:
dframe

    0   1   2
0   1   2   3
1 NaN   5   6
2   7 NaN   9
3 NaN NaN NaN

In [13]:
clean_dframe = dframe.dropna()

In [14]:
clean_dframe

   0  1  2
0  1  2  3

In [15]:
#drops only if the entire row is NaN
dframe.dropna(how='all')

    0   1  2
0   1   2  3
1 NaN   5  6
2   7 NaN  9

In [16]:
#drops entire data since all rows have atleast one NaN
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [17]:
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [18]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [20]:
dframe2.dropna(thresh=3)

   0   1  2   3
0  1   2  3 NaN
1  2 NaN  5   6

In [21]:
dframe2.fillna(1)

   0  1  2  3
0  1  2  3  1
1  2  1  5  6
2  1  7  1  9
3  1  1  1  1

In [22]:
dframe2.fillna({0:0,1:1,2:2,3:3})

   0  1  2  3
0  1  2  3  3
1  2  1  5  6
2  0  7  2  9
3  1  1  2  3

In [23]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [24]:
dframe2.fillna(0,inplace=True)

In [25]:
dframe2

   0  1  2  3
0  1  2  3  0
1  2  0  5  6
2  0  7  0  9
3  1  0  0  0